import 'package:flutter/material.dart';
import 'package:love_shayari/secondpage.dart';

class first extends StatefulWidget {
  int i;
  String l;

  first(this.i, this.l);

  @override
  State<first> createState() => _firstState();
}

class _firstState extends State<first> {
  List love = [
    'Har Sham Se Tera Izhaar Kiya Karte Hai,Har Khwab Me Tera Didar Kiya Karte Hai,Diwane Hi To Hai Hum Tere,Jo Har Waqt Tere Milne Ka Intzaar Kiya Karte Hai !!',
    'Ishq mohabbat to sab karte hai,gam-a-judai se sab darte hai,hum to ishq karte ha na to mahabbat,hum to bas aapki ek mushkurahat pane ke liye taraste hai.',
    'Udas nahi hona kyon ki main saath hoon,Saamne na sahi par aas-paas hoon,Palkon ko band kar jab bhi dil mein dekhoge,Main har pal tumhare sath hu!',
    'Tere Bina Tutkar Bikhar Jayenge,Tum Mil Gaye To Gulshan Ki Tarah Khil Jayenge,Tum Na Mile To Jite Ji Mar Jayenge,Tumhe Paa Liya To Markar Bhi Jee Jayenge.',
    'Sukun Milta Hai Jab Unse Baat Hoti Hai,Hajaar Raaton Mein Woh Ek Raat Hoti Hai,Nigah Uthakar Jab Dekhte Hain Woh Meri Taraf,Mere Liye Wohi Pal Poori Kaaynat Hoti Hai.',
    'Jane Us Shakhs Ko Kaise Ye Hunar Aata Hai,Raat Hoti Hai To Aakho Me Utar Aata Hai,Main Us Ke Khayalo Se Bach Ke Kahan Jaaun,Wo Meri Soch Ke Har Raste Pe Najar Aata Hai.',
    'Uski Mohabbat Ka Silsila Bhi,Kya Ajeeb Silsila Tha,Apna Banaya Bhi Nahi Aur,Kisi Ka Hone Bhi Na Diya.',
    'Kachchi Deewar Hoon Thokar Na Lagana Mujhe,Apni Najron Mein Basaa Kar Na Girana Mujhe,Tumko Aankhon Mein Tasawwur Ki Tarah Rakhta Hoon,Dil Mein Dhadkan Ki Tarah Tum Bhi Basana Mujhe.',
    'Kabhi Sambhle Toh Kabhi Bikhar Gaye,Ab Toh Khud Mein Hi Simat Gaye Hum,Yun Toh Jamana Khareed Nahi Sakta Hamein,Magar Pyaar Ke Do Lafzon Se Bik Gaye.'
  ];
  List sad = [
    'કેટલી વખત માફ કરું તને તે ગઈ વખતે પણ, એવું જ કહીયુ હતું કે હવે આવી ભૂલ નહિ થાય.,'
        'કોઈની પાસે એટલી પણ ઉમ્મીદ ના રાખવી કે, ઉમ્મીદની સાથે સાથે તમે પણ તૂટી જાઓ!',
    'પ્રેમનાં પ્યાલા થોળા હળવેક થી પીજો...હોઠ તો પચાવી લેશે પણ દિલ ને બહુ તકલીફ પડશે...💕',
    'હિસાબ તો નથી રાખ્યો કે વિરહ ને કેટલા વર્ષો વીતી ગયા, કેટલીક મુલાકાત એવી યાદ આવે છે જાણે કાલની જ વાત હોય.',
    'પ્રેમ હતો જેનાથી,નફરત છે હવે એનાથી.💔',
    'વાત ખાલી છોડવાની હતી, છોડીને નહિ તમે તો તોડીને ચાલ્યા ગયા.',
    'પ્રેમ કર્યો એટલે તો ભૂલી નથી શકતા,જો ખાલી Time Pass જ કર્યો હોત ને,તો ક્યારના Sorry કહીને Block કરી નાખ્યા હોત.',
    'આજકાલ તો એ અમને Digital નફરત કરે છે, અમને Online જોઈને પોતે Offline થઈ જાય છે.',
    'જનમ જનમનો સાથ માંગતી હતી અને, બે મિનિટમાં ગુસ્સો કરીને જતી રહી.',
    'એક દિવસ તો એવો આવશે જ કે જયારે મારા જેટલું દર્દ તને પણ થશે.'
  ];
  List Frindship = [
    'જીવનમાં મિત્રો રાખવા જરૂરી છે,નહી તો દિલની વાત DP અનેસ્ટેટસ બદલાવી બદલાવીને કહેવી પડે.',
    'એક દોસ્તી એવી પણ કરી લઈએ,સાથે ભલે ના રહીએપણ સાથ આપી જિંદગી જીવી લઈએ.',
    'જો દોસ્તી તૂટશે તો તો જીંદગી વિખરાય જશે,આ કાંઈ તમારા વાળ નથી તો સેટ થઈ જશેપકડી જ લો હાથ એનો જે આપને ખુશી આપે.નહી તો રડતાંં ને રડતાં જ જીંદગી આખી વીતી જશે.',
    'ના કરો અનુમાન મને કોણ કોણ ગમે છે,હોઠો પર મારા કોનું જ નામ રમે છે,એ તુ જ છે પગલી કે જેની દોસ્તી અમને ગમી,બાકી આથમતી સંધ્યાએ તો સુરજ પણમારી સામે નમે છે.',
    'મારું જીવન તો હતું ઘણું સંગીન,હમેશા રેહતો હતો હું ગમગીન,તારી દોસ્તીએ જીવનમાં એવા રંગો પૂર્યા કે,જીવન મારું બની ગયું એકદમ રંગીન...',
    'યાદે ભી દોસ્તો સે હૈ,મુલાકાતે ભી દોસ્તો સે હૈ,સપને ભી દોસ્તો સે હૈ,અપને ભી દોસ્તો સે હૈ,યા ફિર યુ હી કહે કી ........અપની તો દુનિયા હી દોસ્તો સે હૈ ….',
    'તું દોસ્ત બનીશ એવી મને ક્યાં ખબર હતી,દોસ્તમાં પણ ખાસ બનીશ એવી ક્યાં ખબર હતી,તારા વગર પણ એક ઝીંદગી હતીપણ તું જ મારી જીંદગી બનીશ એવી ક્યાં ખબર હતી.',
    'અમારી ભૂલો ને માફ કરતા રેહજો,જિંદગી માં દોસ્તો ની કમીને પૂરી કરતા રેહજો,કદાચ હું ના ચાલી શકું તમારી સાથે,તો પણ તમે ડગલે ને પગલે સાથ તો આપતા રેહજો…'
        'મારું જીવન તો હતું ઘણું સંગીન,હમેશા રેહતો હતો હું ગમગીન,તારી દોસ્તીએ જીવનમાં એવા રંગો પૂર્યા કે,જીવન મારું બની ગયું એકદમ રંગીન...'
  ];
  List god = [
    'હ્રદય પર જો પ્રભુનું આસન હોય અનેમન પર જો પ્રભુનું શાસન હોયતેનું જીવન હંમેશા વૃંદાવન હોય',
    'જો તમને ભગવાન પાસે કંઈ માંગવાથી નહીં મળે, તો તેમના પર નારાજ ના થશો કારણ કે ભગવાન તમને જે ગમે તે આપતા નથી પણ તેઓ જે તમારા માટે સારું છે તે આપે છે.',
    'ચાલ માન્યું કે તું પથ્થર નથી…તોય તું એટલો સધ્ધર નથી…લોકો લુટી જાય છે તારા મંદિર ને…અર્થ એનો એજ છે કે તું અંદર નથી…',
  ];
  List life = [
    'જીવનમાં અન્યોની સૂઝ અને અનુભવ એ પ્રેરણા અને પ્રોત્સાહન માટેનું મૂલ્યવાન સ્રોત છે અને સફળ નેતાઓ અને ઉદ્યોગસાહસિકો પાસેથી શીખવું એ એક ઉત્તમ રીત છે.',
    'વિશ્વની સૌથી સફળ વ્યક્તિઓએ પણ તેમના જીવનમાં અડચણો અને મુશ્કેલીઓનો વાજબી હિસ્સો અનુભવ્યો છે. અને તેમના પડકારો તેમજ તેમની સફળતામાંથી ઘણું શીખવાનું છે. તો ચાલો, ઉત્સાહિત થવા અને પ્રેરિત થવા માટે તેમના કેટલાક અવતરણો પર એક નજર કરીએ.',
    'ધારીએ એવું થતું નથી અને વિચાર્યું હોય એવું હોતું નથી એનું નામ જિંદગી.',
    'બુદ્ધિ બદામ ખાવાથી નહીં પણ જિંદગીમાં ઠોકર ખાવાથી વધે છે.',
    'જિંદગીમાં ખુશ રહેવાનું , કોઈ પ્રેશરકુકર પાસેથી શીખો ! માથે પ્રેશર, નીચે આગ ,તોય મસ્તીથી સીટી વગાડે !',
    'જીવનમાં કોઈના વગર અટકતું તો કંઈ નથી પણ  ખટકતું ચોકકસ હોય છે.',
    'મીઠું સ્મિત તીખો ગુસ્સો અને ખારા આંસુ આ ત્રણેય થી બનતી વાનગી એટલે ‘ જિંદગી ‘ ',
    'Life માં જોરથી ધક્કો માર્યો લોકોએ ડુબાડવા માટે , ફાયદો એ થયો કે હું તરતા શીખી ગયો.',
    'તમારે જીવનમાં ઘણી પરાજયનો સામનો કરવો પડશે, પરંતુ તમારી જાતને ક્યારેય પરાજિત ન થવા દો.',
  ];
  List Romentik = [
    'જોકે આમ તો હું એક શાયર નથી પણ પ્રેમ માં એક વાર પડિયા પછી એમ લાગે છે કે શાયર ના થોડા લક્ષણ તો આવી ગયા છે.😄 તો ચાલો મારા દિલની વાતો ને 2 પંક્તિ માં સમજીએ.',
    'તારા પ્રેમ એ કંઇક એ રીતે શણગાર્યો છે 🥰 મને,અરીસો પણ કહે છે, "મારી શુ જરૂરત છે તને!"',
    '"અમસ્તાજ હોઠો પર એક મીઠું હાસ્ય 😊 આવી જાય છે,આમજ બેઠો હોઉં છું ને તારો ખ્યાલ આવી જાય છે."',
    '"કંઈ પૂછતો નથી, છતાં બધું જાણતો રહે છે,અંતરે રહેવા છતાં, અંતર ❤️ મા મહેકતો રહે છે."',
    '"બસ એક તારા નામની રેખા હાથો માં માંગુ 🤲 છું ,હું ક્યાં નસીબ થઈ કાંઈ ખાસ માંગુ છું..."',
    '"આકાશ હેરાન છે જોઈને મારા ચાંદ 🌛 ને જમીન પર,પછી હું હોશ ખોઈ બેઠો છું એમાં મોટી વાત શું છે."',
    '"એમની નજરમાં ફરક આજે પણ નથી...પહેલા ફરી ફરીને જોતા હતા ને હવે જોઇને ફરી 🙁 જાય છે..."',
    '"સાંભળ, બહુ જ લાંબી વાતો કરવી છે તારા સાથે,તું આવજે મારી પાસે તારી આખી ઝીંદગી ❤️ લઇ ને."'
  ];
  List Brithday = [
    'આજના જન્મ દિવસે...આપને આનંદી મન મુબારકખૂંટે નહી તેટલું ધન મુબારકતંદુરસ્તી ભર્યું તન મુબારકઆપ ને જન્મ દિવસ મુબારક',
    'સફળતા... તમને ચૂમે.સુખ... તમને ગળે લગાવે.તક... તમને પસંદ કરે.સમૃદ્ધિ... તમારો પીછો કરે.પ્રેમ... તમને ભેટી પડે.શ્રેષ્ઠ મિત્રો... તમારી આસપાસ રહે...જન્મદિવસની મુબારક !!!',
    'તમારો જન્મદિવસ એ બીજા 365 દિવસના ન​વા વર્ષ​ની યાત્રાનો પ્રથમ દિવસ છે.આ વર્ષે તમારું નામ વિશ્વમાં ઝળહળે.સવારીનો આનંદ માણો.',
    'જન્મદિવસ🎂 ની હાદિઁક🎊 શુભકામના🍫આખી દુનિયા🌏 ને ખુશ😊 રાખવાવાળો મારો 🍃~મહાદેવ~🍃 હર પલ તમારી ખુશી🙂 નો ખ્યાલ રાખે અને આપની હર એક ઈચ્છા પૂરી કરે એવી પ્રાર્થના📿🙏🏻',
    'તમે તમારી સફળતાઓની સીમા બહારનું પ્રાપ્ત કરો,આ વર્ષે ભગવાન તમને તેના બધા આશીર્વાદ અને પ્રેમ વરસાવશે .. લાંબુ જીવન જીવો,જન્મદિવસની શુભેચ્છા ...',
    'ભગવાન તમને દુનિયાભરનુ સુખ આપેજીવનમાં દરેક પગલે પ્રગતિ આપે;તમારા હોઠ પર સદાય સ્મિત રહે;જન્મદિવસ પર આવી તમને ભેટ આપે'
        'સૂરજના કિરણો... તેઝ આપે,ખીલતાં ફૂલો... ખુશ્બૂ આપે,અમે જે આપીએ એ પણ ઓછું પડે,ભગવાન જન્મદિવસ પર જિંદગીનો બધો આનંદ આપે ...જન્મદિવસની મુબારક !!!',
    'જન્મ દિવસ ની શુભેચ્છા .આખું વર્ષ તન, મન અને ધન થી સારું રહે,નવું વર્ષ સારુ નીવડે એવી ભગવાનને પ્રાર્થના સાથે જન્મ દિવસ ની ઘણી ઘણી શુભેચ્છા.'
  ];
  List holi = [
    'હોળી-ધુળેટીના 🌈રંગબેરંગી કલર જેવું સુંદર તમારું જીવન બને તેવી શુભકામનાઓ.',
    'હું ઇચ્છુ છું કે, તમારું આગળનું વર્ષ  સુખી-સમૃદ્ધ અને દરેક દિવસ હોળીની જેમ રંગીન રહે. આ પવિત્ર તહેવાર નિમિત્તે 👦આપને તથા આપના👨‍👨‍👦 પરિવાર ને ખૂબ ખૂબ શુભેચ્છાઓ.',
    'હોળી-ધુળેટીનો આ તહેવાર, લાવ્યો હજારો ખુશિયાં,હોળીના પવિત્ર તહેવાર પર, આપ સૌને અભિનંદન 🤗!!',
    'રંગોનો આ તહેવાર તમને અને તમારા પરિવારના જીવનમાં ઉત્સાહ, સુખ અને તેજ લાવે. મારા તરફથી હોળી અને ધુળેટી ની હાર્દિક શુભકામનાઓ. ',
    'આજ મુબારક કલ મુબારક,હોલી કે હર પલ મુબારક.રંગ-બિરંગી હોલી મેં,હોલી કા હર રંગ મુબારક.',
    'હંમેશા મીઠી રહે તમારી બોલી,ખુશીઓ થી ભરાઈ જાય તમારી જોલી,તમને સૌને મારા તરફથી હેપી હોલી.',
    'આ હોળીના🔥 પાવન તહેવાર પર સૌના જીવનમાં 👹આસુરી શક્તિઓનો નાશ થાય અને દૈવીશકિત ના વિજય નો🔱 જયઘોષ થાય તેવી પ્રાર્થના.',
    'યે રંગો કા ત્યોહાર આયા હૈ, સાથ અપને ખુશિયાં લાયા હૈં,હમસે પહલે કોઈ રંગ ન દે આપકો ઇસીલિએ હમને,શુભકામનાઓ કા રંગ સબસે પહલે આપકો ભિજવાયા હૈં.'
  ];
  List Politics = [
    'ख्याल होता नेताओं को,तो जनता बेहाल न होती,पैसा इनकी भूख न होती,तो शहीद सैनिकों पर राजनीति न होती.',
    'जिए तो सदा इसी के लिएयही अभिमान रहे सहर्षन्यौछावर कर दे सर्वस्वहमारा प्यारा भारतवर्ष',
    'झूठ पकड़ना कितना मुश्किल होता हैं,सच भी जब साजिश में शामिल होता हैं.',
    'यहाँ हर शासक दुर्योधन हैयहाँ न्याय न मिल पायेगासुनो द्रोपदी शस्त्र उठा लोअब गोविन्द न आयेगा.',
    'कभी माँ के भ्रूण में ही है मर जाती,कभी दरिंदों के हाथों है मसली जाती,कभी यह दहेज़ के लिभियों के हाथ हैं जल जाती,हम भारतीय है, अब हमें किसी बात पर शर्म नहीं आती.',
    'सच बातों पर चुप्पी और झूठ बातों पर चिल्लाए है,ये इसी देश के नेता हैं या चिड़ियाघर से आए हैं.',
    'नई कहानी लिखकर लौटे आन-बान-सम्मान की,अम्बर में लहराए तिरंगा खुश्बू हिन्दुस्तान की.'
  ];
  List Congratulation = [
    'શબ્દ અને વિચાર અંતર વધારી દે છે,કારણ કે ક્યારેક આપણે સમજી નથી શકતા તોક્યારેક આપણે સમજાવી નથી શકતા.',
    'પરિસ્થિતિ એક જ હોય છે,તેમાં નિષ્ફળ વ્યક્તિ પાસે કારણો હોય છેઅને સફળ વ્યક્તિ પાસે તારણો હોય છે.',
    'સમાજનાં ડરથી તમારો સાચો નિર્ણય ન બદલો,સમાજ તમને શિખામણ આપશે, ખાવા માટે રોટલી નહિ.',
    'જયારે આખી દુનિયા કહે કે હાર માની લે અનેતમારી અંદરથી અવાજ આવે કે હજુ એક પ્રયાસ કર,તો સમજી લેવાનું કે આ વખતે તમારી જીત પાક્કી છે.',
    'જીવનમાં મળે છે તો ઘણું બધું આપણનેપણ આપણે ગણતરી તોએની જ કરીએ છીએ જે નથી મળતું.',
    'ઈશ્વર તપાવશે જરૂર પણ દાઝવા નહિ દે,એટલા માટે મુશ્કેલીમાં શ્રદ્ધા ગુમાવશો નહિ',
    'સબંધ બાંધવા એ લોન લેવા જેટલા સહેલા હોય છે,પરંતુ નિભાવવા એ હપ્તા ભરવા જેટલા અઘરા હોય છે.',
    'ઘણી યાદો એવી હોય છે,જેને યાદ કરીને હોઠ તો હસે છેપણ આંખો રડી પડે છે.'
  ];
  List Motivation = [
    'પરિસ્થિતિ ‘ માણસને ઉમર થી પહેલા ‘ વધારે સમજદાર બનાવી દે છે .',
    'હે પ્રભુ તે જે નથી આપ્યું તેનો અફસોસ ક્યારેય નહિ કરું , ‘ કારણકે તે મને એવું ઘણું આપ્યું છે , જેની મેં કલ્પના પણ નહોતી કરી',
    'હતા કિનારે તોય અમે પ્યાસા રહી ગયા , જાણે લાગણીના વ્યવહારમાં અમે કાચા રહી ગયા .. !!',
    'સદ્દવ્યવહાર એ ભાષા છે જે બહેરો સાંભળીશકે છે અને આંધળો જોઈ શકે છે',
    'કોઈ તૂટે તો સજાવતા શીખો, કોઈ રિસાય તો મનાવતા શીખો..સાહેબ સંબંધો તો તકદીરથી મળે છે,બસ એને ખૂબસૂરતીથી નિભાવતા શીખો.',
    'ધીરજ એટલે.. રાહ જોવાની ક્ષમતા નહિ પણ રાહ જોતીવખતે સ્વભાવને કાબુમાં રાખવાની ક્ષમતા. શુભ સવાર',
    'એક વૃક્ષે કબૂલાત કરી કે, મારા પાંદડા રોજ ખરે છે,છતાંય પવન સાથે મેં સંબંધ બગાડયા નથી.. શુભ સવાર દોસ્ત',
    'ભરોસો અને આશીર્વાદ કયારેય દેખાતા નથી..પણ તે અસંભવ ને સંભવ બનાવી દે છે..!',
  ];
  List comedy = [
    'ગામમા વિદેશથી ભુરીયા આવ્યા.....દરવાજે લીંબુ 🍋મરચા🌶 લટકતા જોઇ ને બોલ્યા What is this? રઘો : ઇ એન્ટી વાયરસ છે.મેડ ઇન ઇન્ડીયા😝😝😝😝',
    'જે દોસ્ત કહેતો હતો કે જિંદગીભર તારો સાથ નહીં છોડું,એ જ સાલો ટ્રાફિક પોલીસ જોઇને રસ્તામાં ઉતારીને ચાલી ગયો !!',
    'આજકાલ શેમ્પુમાં એટલા બધા કાજુ બદામ નાખે છે,કે મન થાય છે જમ્યા પછી એક ચમચી શેમ્પુ પીવાનું ચાલુ કરી લઉં !!😂😂😂😂😂',
    'જે દિવસે વિચારું છું કે જીવનમાં મોટા મોટા જ કામ કરવા છે,એ દિવસે જ ઘરવાળા ગેસનો બાટલો લેવા મોકલી દે છે !!',
    'મેરા દીલ જિસ દીલ પે ફીદા હૈઉસકા અગલે હપ્તે વિવાહ હૈ।',
    'અમુક અમુક મિત્રોને જોઇને વિચાર આવે,કે આ આવો છે તો એના છોકરા કેવા થશે !!',
    'પેટ્રોલના રોજ વધતા ભાવથી છોકરીઓનું એક સપનું પૂરું થશે,એમના સપનાનો રાજકુમાર હવે ઘોડા પર બેસીને આવશે !!',
  ];
  List temp = [];
  int? pos;

  @override
  void initState() {
    super.initState();
    pos = widget.i;
    if (pos == 0) {
      temp = love;
    }
    if (pos == 1) {
      temp = sad;
    }
    if (pos == 2) {
      temp = Frindship;
    }
    if (pos == 3) {
      temp = god;
    }
    if (pos == 4) {
      temp = life;
    }
    if (pos == 5) {
      temp = Romentik;
    }
    if (pos == 6) {
      temp = Brithday;
    }
    if (pos == 7) {
      temp = holi;
    }
    if (pos == 8) {
      temp = Politics;
    }
    if (pos == 9) {
      temp = Congratulation;
    }
    if (pos == 10) {
      temp = Motivation;
    }
    if (pos == 11) {
      temp = comedy;
    }
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(),
      body: ListView.separated(
          separatorBuilder: (context, index) {
            return Divider(
              color: Colors.purpleAccent,
              thickness: 2,
              height: 10,
              indent: 10,
              endIndent: 10,
            );
          },
          itemBuilder: (context, index) {
            return ListTile(
              textColor: Colors.black,
              tileColor: Colors.amberAccent,
              focusColor: Colors.orange,
              hoverColor: Colors.redAccent,
              selectedTileColor: Colors.lightBlue,
              onTap: () {
                setState(() {
                  Navigator.push(
                    context,
                    MaterialPageRoute(
                      builder: (context) {
                        return second(index, temp);
                      },
                    ),
                  );
                });
              },
              leading: Container(
                height: 70,
                width: 70,
                child: Image.network(widget.l),
              ),
              title: Text(
                "${temp[index]}",
                style: TextStyle(fontSize: 15, fontWeight: FontWeight.bold),
              ),
            );
          },
          itemCount: temp.length),
    );
  }
}
